Repository: almostearthling/when-wizard
Catalog: po/*.po
Languages: it

source: Enter a value
it: Inserire un valore

source: Do...
it: Esegui...

source: A simple Wizard for easier setup of the When scheduler.
it: Un semplice wizard per la configurazione dello scheduler When

source: When's Web Page
it: Pagina web di When

source: Condition:
it: Condizione:

source: Consequence:
it: Conseguenza:

source: Actions
it: Azioni

source: History
it: Cronologia

source: Install or Upgrade Plugin
it: Installa o aggiornamentto plugin

source: Uninstall Existing Inactive Plugin
it: Disinstalla plugin inattivo

source: Choose Package:
it: Scegliere pacchetto:

source: Select Plugin:
it: Scegliere plugin:

source: Plugins
it: Plugin

source: Import Actions and Items from Item Definition File
it: Importazione azioni ed elementi da un file di definizione

source: Remove Actions Imported from Item Definition Files
it: Rimozione elementi importati da un file di definizione

source: Choose an Item Definition File:
it: Scegliere un file di definizione:

source: Select an Imported Item Definition File:
it: Scegliere un file di definizione importato:

source: Import
it: Importazione

source: Apply Generic Settings for Wizard Based Management
it: Impostazioni generiche per la gestione basata su wizard

source: Create or Restore Desktop Icons for Wizard Applications
it: Creazione o ripristino delle icone per le applicazioni del wizard

source: Scheduler Reactivity Normal
it: Reattività dello scheduler normale

source: Scheduler in Lazy Mode
it: Reattività dello scheduler bassa

source: Utility
it: Utilità

source: When should it happen?
it: Quando deve accadere?

source: Type:
it: Tipo:

source: Click Finish to exit, or click Restart to start over.
it: Fare clic su Termina per uscire, o Ricomincia per ricominciare.

source: Review your choice:
it: Controllare le scelte:

source: Click the Next button to register or hit Esc to abort.
it: Fare clic su Avanti per registrare o premere Esc per annullare.

source: What do you want to do?
it: Cosa si desidera fare?

source: Category:
it: Categoria:

source: Enter the complete shell command to run:
it: Inserire il comando di shell completo:

source: Select the application to be launched:
it: Selezionare l'applicazione da avviare:

source: Specify the full command line to check:
it: Indicare il comando di test:

source: Specify how long the computer must be idle:
it: Indicare il tempo di inattività:

source: Minutes
it: Minuti

source: Hours
it: Ore

source: Specify the duration of the interval:
it: Indicare la durata dell'intervallo:

source: Select the time of day in 24h format:
it: Inicare l'orario in formato 24h:

source: Hour
it: Ore

source: Minute
it: Minuti

source: Choose the background image:
it: Scegliere l'immagine di sfondo:

source: Choose...
it: Scegliere...

source: Choose source and destination:
it: Scegliere origine e destinazione:

source: Destination:
it: Destinazione:

source: Label:
it: Etichetta:

source: Refresh
it: Aggiorna

source: Choose the directory to open:
it: Indicare la directory da mostrare:

source: Choose the file to open:
it: Indicare il file da aprire:

source: Source:
it: Origine:

source: Define the badge to show:
it: Indicare il messaggio:

source: Title
it: Titolo

source: Icon
it: Icona

source: Badge message
it: Messaggio

source: Define email contents and recipient:
it: Indicare contenuto e destinatario della email:

source: Send To
it: Invia a

source: Message Text
it: Testo

source: Choose a sound file to play:
it: Scegliere un file sonoro:

source: When Wizard: Main Wizard Application
it: When Wizard: Applicazione Principale

source: When Wizard: Manager Utility
it: When Wizard: Utilità di Gestione

source: could not find a running instance of When
it: impossibile trovare un'istanza di When

source: required arguments missing or invalid
it: parametri non validi o mancanti

source: the specified plugin could not be installed
it: il plugin indicato non può essere installato

source: the specified plugin could not be uninstalled
it: il plugin indicato non può essere rimosso

source: could not package plugin: check file names
it: impossibile creare package: controllare i nomi dei file

source: the required plugin could not be loaded
it: il plugin richiesto non può essere caricato

source: plugin successfully packaged
it: package creato con successo

source: %s plugins successfully packaged
it: %s package creati con successo

source: Applications
it: Applicazioni

source: Desktop and System Settings
it: Impostazioni desktop e sistema

source: Session Management
it: Gestione sessione

source: Power Management
it: Gestione alimentazione

source: File and Folder Operations
it: Operazioni su file e cartelle

source: Miscellaneous
it: Varie

source: Time Related
it: Temporizzazione

source: Session or System Event
it: Eventi di sessione o di sistema

source: Condition
it: Condizione

source: Consequence
it: Conseguenza

source: Time
it: Orario

source: Name
it: Nome

source: Description
it: Descrizione

source: Duration
it: Durata

source: Success
it: Successo

source: Condition:
it: Condizione:

source: The action was correctly registered!
it: L'azione è stata registrata correttamente!

source: The action could not be registered: please try again.
it: Impossibile registrare l'azione: si prega di riprovare

source: Finish
it: Termina

source: Restart
it: Ricomincia

source: Are you sure you want to delete the selected action?
it: Si è sicuri di voler eliminare l'azione selezionata?

source: Are you sure you want to delete all actions?
it: Si è sicuri di voler eliminare tutte le azioni?

source: Are you sure you want to uninstall the %s plugin?
it: Si è sicuri di voler eliminare il plugin %s?

source: Are you sure you want to remove items imported from %s?
it: Si vogliono davvero eliminare gli eventi importati da %s?

source: The specified plugin could not be installed. Ensure that it is a proper package and/or contact the author.
it: Impossibile installare il plugin specificato. Assicurarsi che sia un package appropriato o contattare l'autore.

source: The specified plugin could not be uninstalled.
it: Impossibile disinstallare il plugin specificato.

source: The plugin has been correctly installed.
it: Il plugin è stato installato correttamente.

source: The plugin has been correctly uninstalled.
it: Il plugin è stato disinstallato correttamente.

source: The specified item definition file could not be imported. Check file consistency.
it: Impossibile importare il file di definizione eventi specificato. Controllare che sia appropriato.

source: The item definition file could not be read.
it: Impossibile leggere il file di definizione elementi.

source: An item definition file with the same name has been already imported: remove it first.
it: Un file di definizione elementi con lo stesso nome è già stato importato. Si prega di rimuoverlo prima.

source: Not all items from the specified definition file could be removed: please check dependencies.
it: Non è stato possibile importare tutti gli elementi dal file indicato: si prega di controllare le dipendenze.

source: Items imported successfully.
it: Elementi importati con successo.

source: Items removed successfully.
it: Elementi rimossi con successo.

source: Unable to communicate with a running When instance.
it: Impossibile comunicare con un'istanza attiva di When.

source: Could not apply at least part of the requested changes.
it: Impossibile applicare tutte le impostazioni richieste.

source: Could not create all desktop icons.
it: Impossibile creare tutte le icone.

source: All changes applied successfully.
it: Tutte le modifiche sono state effettuate.

source: Choose a Package File
it: Scegliere un package

source: Choose an Item Definition File
it: Scegliere un file di definizione elementi

source: This task is used to start a non-interactive system command: you can provide the whole command line that will be executed in the background without user interaction.
it: Azione utilizzata per avviare un comando di sistema in modo non interattivo: è possibile indicare la linea di comando completa che sarà eseguita in background.

source: Command Launcher
it: Esegue Comando

source: Run a Command using the default Shell
it: Esegue un comando utilizzando la shell predefinita

source: A command based on '%s' will be run
it: Sarà eseguito un comando basato su '%s'

source: Use this action to launch a desktop application: choose one from the list and it will be started once the referring condition occurs. You will be able to interact with the application and will have to close it yourself when you finished using it.
it: Quest'azione avvia un'applicazione grafica: sceglierne una dalla lista e verrà avviata appena si verifica la condizione associata. Sarà possibile interagire con essa e non verrà chiusa automaticamente.

source: Application Launcher
it: Avvia Applicazione

source: Start a Desktop Application
it: Avvia un'applicazione in ambiente grafico

source: The application '%s' will be started
it: L'applicazione '%s' verrà avviata

source: This event will occur when the battery is discharging, for example when you use a notebook and plug it off the mains socket.
it: L'evento si verifica quando la batteria è in fase di scarica, ad esempio se si scollega un nootebook dall'alimentazione principale.

source: Discharging
it: Batteria in Scarica

source: The Battery is Discharging
it: La batteria è in fase di scarica

source: When the battery is discharging
it: Quando la batteria si sta scaricando

source: This event will occur when the battery is considered critically low by the system: use this only if the event is not caught by the system itself, for example by hibernating the computer.
it: L'evento si verifica quando la batteria è quasi completamente scarica: da utilizzare solo se il sistema non prende provvedimenti in tal senso, come ad esempio l'ibernazione del computer.

source: Low Battery
it: Batteria Quasi Scarica

source: The Battery is Critically Low
it: La batteria è quasi completamente scarica

source: When the battery is critically low
it: Quando la batteria è quasi completamente scarica

source: This event will occur when the session locks, either because the system is instructed to do so after a while or because you intentionally locked your computer by pressing the lock key combination or by selecting an appropriate menu entry.
it: Evento relativo al blocco della sessione, perché il sistema è impostato affinché ciò avvenga dopo un periodo inattivo oppure perché è stata premuta una combinazione di tasti o selezionata una specifica voce di menù.

source: Session Lock
it: Blocco Sessione

source: Lock the User Session
it: La sessione utente viene bloccata

source: When the session is being locked
it: Quando la sessione utente viene bloccata

source: The Screensaver Starts
it: Avvio dello screensaver

source: When the screensaver starts
it: Quando si avvia lo screensaver

source: This event will occur as soon as the applet is closed, normally when the session itself finishes, at logout or when the computer is shut down.
it: Questo evento si verifica quando lo scheduler viene chiuso, in genere al termine della sessione stessa, al logout o quando si spegne il computer.

source: Session End
it: Termine Sessione

source: End of the User Session
it: Termine della sessione dell'utente

source: When the session is ending
it: Quando la sessione termina

source: This event will occur as soon as the applet is started, normally when the session itself begins, that is at login time or after the computer was turned on.
it: L'evento ha luogo appena lo scheduler si avvia, generalmente quando la sessione inizia, ovvero al login oppure all'accensione del computer.

source: Session Start
it: Avvio Sessione

source: Beginning of the User Session
it: Inizio della sessione utente

source: When the session is beginning
it: Quando la sessione dell'utente ha inizio

source: This event will occur when you unlock the session.
it: L'evento si verifica allo sblocco della sessione.

source: Session Unlock
it: Sblocco Sessione

source: Unlock the User Session
it: Sblocco della sessione utente

source: When the session is unlocked
it: Quando la sessione dell'utente viene sbloccata

source: This tests a command by periodically running it in the background, and if it succeeds (that is, it has an exit status of zero) the associated task is run as a consequence. It can also run specially crafted scripts so that virtually everything in the system can be checked.
it: Un comando viene eseguito periodicamente in background, e se termina con successo (ovvero restituisce un codice 0) il task associato viene eseguito di conseguenza. Possono essere anche eseguiti script specifici in modo da poter verificare praticamente qualsiasi cosa.

source: Command
it: Comando

source: Check successful execution of command
it: Verifica l'esecuzione di un comando

source: After a command based on '%s' runs successfully
it: Quando un comando basato su '%s' viene eseguito con successo

source: Run the associated task after the session has been idle for the specified amount of time. The time can be given either in hours or in minutes.
it: Esegue il task associato dopo che la sessione è rimasta inattiva per il periodo specificato. Il periodo può essere indicato in ore o in minuti.

source: Idle Time
it: Inattività

source: Occur when the workstation is idle
it: Si verifica quando il computer è inattivo

source: minutes
it: minuti

source: hours
it: ore

source: After the computer has been idle for %s
it: Quando il computer è rimasto inattivo per %s

source: Run the associated task whenever a certain interval of time has passed: the time can be specified as an amount of either minutes or hours, and time accounting begins as soon as the scheduler starts.
it: Esegue il compito associato ogni volta che un certo intervallo è trascorso: il periodo può essere indicato in ore o in minuti, e il conteggio inizia all'avvio dello scheduler.

source: Time Interval
it: Intervallo

source: Occur periodically after an amount of time
it: Si verifica periodicamente a intervalli regolari

source: Every %s
it: Ogni %s

source: This pane allows to define the time of day when the condition will be verified. Associated actions will occur every day at the specified time.
it: È possibile definire l'orario in cui la condizione si verificherà. Le azioni associate saranno eseguite ogni ora all'orario indicato.

source: Time Of Day
it: Orario

source: Full Specification of the Time of Day
it: Indicazione completa dell'orario

source: At midnight
it: A mezzanotte

source: At %s:%s o'clock
it: Alle %s:%s

source: Change the desktop background to the image you decide. Of course you can switch it back to the original one using the desktop settings: this can be useful to provide a strong alert when some event occurs.
it: Modifica lo sfondo del desktop con l'immagine specificata. Ovviamente è possibile ripristinarla manualmente: questo può essere utile se si vuole un avvertimento molto visibile in merito a un certo evento.

source: Change Background
it: Modifica Sfondo

source: Modify the Desktop Background
it: Modifica lo sfondo del desktop

source: Choose an Image File
it: Scegliere un file immagine

source: The desktop background will be changed to '%s'
it: Lo sfondo del desktop verrà modificato con l'immagine '%s'

source: Use this task to copy files from a certain removable storage device (such as an USB stick or a CD-ROM) to a selected destination directory. The removable storage device is recognized by its label, which has to be specified.
it: Copia i file da un'unità rimovibile come una chiave USB o un CD-ROM in una cartella di destinazione. L'unità rimovibile è riconosciuta attraverso la sua etichetta, che deve essere specificata.

source: Copy from Removable Media
it: Copia da unità rimovibile

source: Choose a directory
it: Scelta directory

source: Files from %s will be copied to %s
it: I file saranno copiati dall'unità '%s' alla directory '%s'

source: This task opens a directory in the default file manager application. The specified directory is shown on your desktop and you can search for files and perform any file operations as long as permissions are granted to do so.
it: Apre una directory con il file manager predefinito. La directory indicata è mostrata sul desktop e si possono effettuare operazioni sui file ammesso che se ne abbiano i diritti.

source: Open Directory
it: Apre Directory

source: Show a Directory in File Manager
it: Visualizza una directory nel file manager

source: The '%s' directory will be open
it: La directory '%s' sarà visualizzata

source: This task opens a file in its associated default application: it uses the system settings to determine the action to perform (that is, the application used) to open the specified file. The file can be read and, if you have the permissions, modified and saved interactively.
it: Apre un file con l'applicazione associata predefinita: usa le impostazioni di sistema per determinare l'azione (ovvero l'applicazione) da eseguire. Il file può essere letto e modificato ammesso che se ne abbiano i diritti.

source: Open File
it: Apertura File

source: Open a File
it: Apertura di un file

source: Choose a file
it: Scelta file

source: The file '%s' will be open
it: Il file '%s' verrà aperto

source: This action synchronizes two directories: it copies all files in the source directory to the destination making sure that files in both directories are always up to date. It can also propagate deletions if desired. This is useful for unattended backups of valuable data.
it: Sincronizzazione di due directory: copia i file da un'origine a una destinazione assicurandosi che i file siano sempre aggiornati. Se necessario anche le cancellazioni vengono propagate.

source: Synchronize
it: Sincronizza

source: Synchronize Two Directories
it: Sincronizzazione di due directory

source: Choose source directory
it: Selezionare la directory origine

source: Choose destination directory
it: Selezionare la directory destinazione

source: This action shows a notification badge when the chosen condition occurs: it can be useful if you are at the computer and you want visible feedback about a certain event.
it: Visualizza una notifica a monitor al verificarsi della condizione scelta: è utile se si è al computer e si desidera un feedback visuale su un certo evento.

source: Show Badge
it: Notifica

source: Show a Notification Badge
it: Visualizza una notifica a monitor

source: A notification badge will be displayed
it: Una notifica verrà visualizzata sul monitor

source: Information
it: Informazione

source: Question
it: Domanda

source: Warning
it: Avvertimento

source: Error
it: Errore

source: This task sends an e-mail message to the provided address. You can specify the text (environment variables will be expanded if needed) and all the parameters necessary to correctly perform the operation. This is useful if you want to be notified of a certain event when you are away.
it: Invia un messaggio e-mail all'indirizzo indicato. Si può specificare il testo (le variabili d'ambiente sono espanse all'interno) e tutti i parametri necessari all'operazione. Utile nel caso in cui si voglia essere avvertiti di un evento quando si è distanti dal computer.

source: Send an E-mail Message
it: Invia un messaggio e-mail

source: An email will be sent to %s
it: Verrà inviata una e-mail a %s

source: This actions plays the specified sound when the chosen condition occurs: it can be useful if you are near the computer and you want audible feedback about a certain event.
it: Questo task riproduce un file audio quando si verifica la condizione scelta: può essere utile se si è nei dintorni del computer e si desidera feedback auditivo su un certo evento.

source: Sound
it: Audio

source: Play a Sound
it: Riproduce un file audio

source: The sound '%s' will be played
it: Il file audio '%s' sarà riprodotto

source: This action hibernates your Workstation, saving its current state and entering a very low-consumption mode: depending on your OS release and your settings the system will resume operations by either providing input or pressing the power button. In some cases network activity could cause a wakeup.
it: Pone il computer in stato di ibernazione, congelando lo stato corrente ed entrando in una modalità a consumo pressoché nullo: a seconda della release e delle impostazioni, il computer potrebbe riprendere le operazioni con la pressione di un tasto qualsiasi, con il tasto di accensione o con attività di rete.

source: Hibernate
it: Ibernazione

source: Hibernate your Workstation
it: Ibernazione del computer

source: The system will suspend or hibernate
it: Il sistema verrà sospeso oppure ibernato

source: This action reboots your Workstation, exactly in the same way as you would do using the session shutdown menu. Your computer closes all applications and flushes all data to disk to enable a clean restart, however be sure that your data is saved (or at least auto-saved) before letting the computer restart.
it: Questo task riavvia il sistema, nello stesso modo in cui ciò avverrebbe usando il menù di sistema apposito. Tutte le applicazioni vengono chiuse e le operazioni pendenti portate a termine, tuttavia c'è il rischio di perdere dati se non sono stati salvati.

source: Reboot
it: Riavvio

source: Reboot your Workstation
it: Riavvia il sistema

source: The system will reboot
it: Il sistema si riavvierà

source: This action turns off your Workstation, exactly in the same way as you would do using the session shutdown menu. Your computer closes all applications and flushes all data to disk to enable a clean startup, however be sure that your data is saved (or at least auto-saved) before letting the computer shut down.
it: Spegne il computer, esattamente come ciò avverrebbe utilizzando il menù di sistema apposito. Tutte le applicazioni vengono chiuse e le operazioni pendenti portate a termine, tuttavia c'è il rischio di perdere dati se non sono stati salvati.

source: Shutdown
it: Spegnimento

source: Shut Down your Workstation
it: Spegnimento del computer

source: The system will be shut down
it: Il computer verrà spento

source: This task locks your session without logging you out: it protects your Workstation by asking for a password to start over to work, but does not close any application.
it: Blocca la sessione senza effettuare il logout: protegge la postazione richiedendo una password per ricominciare a lavorare, ma tuttavia non termina alcuna applicazione.

source: Lock
it: Blocco

source: The session will be locked
it: La sessione verrà bloccata

source: This task logs you out from the workstation. It closes all applications and your desktop session, returning to the login screen. Be careful when you use this task, because when it occurs you are likely to loose any unsaved work.
it: Questa azione effettua il logout dalla sessione. Chiude le applicazioni e ritorna alla schermata di login. Da usare con attenzione, si rischia di perdere il proprio lavoro se non è stato salvato.

source: Session Logout
it: Logout dalla sessione

source: The session will be terminated
it: La sessione verrà terminata
